# NumberOfSteps Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayLegendSettings..::..NumberOfSteps Property
AnalysisDisplayLegendSettings Class See Also
---
Number of steps (values between minimum and maximum) to be shown in legend.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public int NumberOfSteps { get; set; }
```

Visual Basic
---
```text
Public Property NumberOfSteps As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int NumberOfSteps {
	int get ();
	void set (int value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentsInconsistentException | When setting this property: numberOfSteps is greater than 1000 or less than 0 |

# See Also
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace